## 판다스 데이터 입출력

In [3]:
import pandas as pd
import numpy as np

## CSV파일 입력

In [6]:
# Magic 명령어
%%writefile sample1.csv
c1, c2, c3
1, 1.11, open
2, 2.22, two
3, 3.33, three

Overwriting sample1.csv

In [7]:
df = pd.read_csv('sample1.csv')

In [8]:
%%writefile sample2.csv
1, 1.11, open
2, 2.22, two
3, 3.33, three

Overwriting sample2.csv

In [9]:
pd.read_csv('sample2.csv')

   1   1.11    open
0  2   2.22     two
1  3   3.33   three

In [10]:
pd.read_csv('sample2.csv',header=None)

   0     1       2
0  1  1.11    open
1  2  2.22     two
2  3  3.33   three

In [11]:
pd.read_csv('sample2.csv',names=['c1','c2','c3'])

   c1    c2      c3
0   1  1.11    open
1   2  2.22     two
2   3  3.33   three

In [12]:
pd.read_csv('sample1.csv', index_col='c1')

      c2      c3
c1
1   1.11    open
2   2.22     two
3   3.33   three

In [13]:
%%writefile sample3.txt
c1        c2        c3        c4
0.179181 -1.538472  1.347553  0.43381
1.024209  0.087307 -1.281997  0.49265
0.417899 -2.002308  0.255245 -1.10515

Overwriting sample3.txt

In [14]:
pd.read_csv('sample3.txt',sep='\s+')

         c1        c2        c3       c4
0  0.179181 -1.538472  1.347553  0.43381
1  1.024209  0.087307 -1.281997  0.49265
2  0.417899 -2.002308  0.255245 -1.10515

In [15]:
%%writefile sample4.txt
파일 제목: sample4.txt
데이터 포맷의 설명:
c1, c2, c3
1, 1.11, one
2, 2.22, two
3, 3.33, three

Overwriting sample4.txt

In [16]:
pd.read_csv('sample4.txt',skiprows=[0,1])

   c1    c2      c3
0   1  1.11     one
1   2  2.22     two
2   3  3.33   three

In [17]:
%%writefile sample5.csv
c1, c2, c3
1, 1.11, one
2, , two
누락, 3.33, three

Overwriting sample5.csv

In [18]:
pd.read_csv('sample5.csv',na_values=['누락',' '],)

    c1    c2      c3
0  1.0  1.11     one
1  2.0   NaN     two
2  NaN  3.33   three

## CSV 파일 출력

In [19]:
df.to_csv('sample6.csv')

In [20]:
!cat sample6.csv

,c1, c2, c3
0,1,1.11, open
1,2,2.22, two
2,3,3.33, three

In [21]:
pd.read_csv('sample6.csv')

   Unnamed: 0  c1    c2      c3
0           0   1  1.11    open
1           1   2  2.22     two
2           2   3  3.33   three

In [22]:
df.to_csv('sample7.txt', sep='|')

In [23]:
!cat sample7.txt

|c1| c2| c3
0|1|1.11| open
1|2|2.22| two
2|3|3.33| three

In [24]:
df.to_csv('sample8.csv', na_rep='누락')

In [25]:
!cat sample8.csv

,c1, c2, c3
0,1,1.11, open
1,2,2.22, two
2,3,3.33, three

##인터넷 상의 csv파일 입력

In [26]:
df = pd.read_csv("https://raw.githubusercontent.com/datascienceschool/docker_rpython/master/data/titanic.csv")

In [27]:
df

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
888          889         0       3  ...  23.4500   NaN         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[891 rows x 12 columns]